Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/money_and_tax/personal_finance/debt/enforcement_of_judgments.html.txt.tmx
Source language: en
Languages: ga

source: If you are unable to pay your debts, you may petition the High Court to be declared bankrupt
ga: Munar féidir leat do chuid fiacha a íoc, féadfaidh tú an cinneadh a dhéanamh gurb é d’fhéimheacht a dhearbhú an réiteach is fearr duit

source: Alternatively, your creditor may apply to have you declared bankrupt if certain conditions are met
ga: I gcásannan áirithe, d'fhéadfaidh creidiúnaí achainí a dhéanamh i leith féimheachta

source: Read more about bankruptcy
ga: Le haghaidh tuilleadh eolais ar fhéimheacht, féach ar ár gcáipéis Cad is féimheacht ann?
